import sys
n = int(sys.stdin.readline())
dp = [[0] * 10 for _ in range(101)]
for i in range(1, 10):
    dp[1][i] = 1
for j in range(2, n+1):
    for k in range(10):
        if k == 0:
            dp[j][k] = dp[j-1][k+1]
        elif k == 9:
            dp[j][k] = dp[j-1][k-1]
        else:
            dp[j][k] = dp[j-1][k-1] + dp[j-1][k+1]
        dp[j][k] %= 1000000000
print(sum(dp[n]) % 1000000000)
'''
숫자의 길이 n이 주어질때 계단수가 몇개나 있는지 찾는 문제
n == 1 이면 1, 2, 3, 4, 5, 6, 7, 8, 9 == 9개
n == 2 이면 10, 12, 21, 23, 32, 34, 43, 45, 54, 56, 65, 67, 76, 78, 87, 89, 98 == 17개
n == 3 이면 101, 121, 123, 210, 212, 232, 234, 321, 323, 343, 345, 432, 434, 454, 456...=33개
앞자릿수가 0이면 1만 선택가능, 1이면 0과 2선택 가능, 5면 4와 6선택 가능..
dp[n][next] = dp[n-1][next-1] + dp[n-1][next+1]

'''